burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_hpdf.h
/* HPDF_FLTyTMFC */
#define HPDF_FLTyTMFC_LTFC              BITS(0,1)                       /*!< clear the threshold monitor low threshold flag */
#define HPDF_FLTyTMFC_HTFC              BITS(8,9)                       /*!< clear the threshold monitor high threshold flag */

/* HPDF_FLTyEMMAX */
#define HPDF_FLTyEMMAX_MAXDC            BIT(0)                          /*!< extremes monitor maximum data channel */
#define HPDF_FLTyEMMAX_MAXVAL           BITS(8,31)                      /*!< extremes monitor maximum value */

/* HPDF_FLTyEMMIN */
#define HPDF_FLTyEMMIN_MINDC            BIT(0)                          /*!< extremes monitor minimum data channel */
#define HPDF_FLTyEMMIN_MINVAL           BITS(8,31)                      /*!< extremes monitor minimum value */

/* constants definitions */
/* parameter struct definitions */
/* channel configuration params */
typedef struct
{
    uint32_t data_packing_mode;                 /* data packing mode for HPDF_CHxPDI register */
    uint32_t channel_multiplexer;               /* channel multiplexer select input data source */
    uint32_t channel_pin_select;                /* channel inputs pins selection */
    uint32_t ck_loss_detector;                  /* clock loss detector */
    uint32_t malfunction_monitor;               /* malfunction monitor */
    uint32_t spi_ck_source;                     /* SPI clock source select */
    uint32_t serial_interface;                  /* serial interface type */
    int32_t  calibration_offset;                /* 24-bit calibration offset */
    uint32_t right_bit_shift;                   /* data right bit-shift */
    uint32_t tm_filter;                         /* threshold monitor Sinc filter order selection */
    uint32_t tm_filter_oversample;              /* threshold monitor filter oversampling rate */
    uint32_t mm_break_signal;                   /* malfunction monitor break signal distribution */
    uint32_t mm_counter_threshold;              /* malfunction monitor counter threshold */
    uint32_t plsk_value;                        /* the number of serial input samples that will be skipped */
}hpdf_channel_parameter_struct;

/* filter configuration params */
typedef struct
{
    uint32_t tm_fast_mode;                      /* threshold monitor fast mode */
    uint32_t tm_channel;                        /* threshold monitor channel */
    int32_t  tm_high_threshold;                 /* threshold monitor high threshold */
    int32_t  tm_low_threshold;                  /* threshold monitor low threshold value */
    uint32_t extreme_monitor_channel;           /* extremes monitor channel */
    uint32_t sinc_filter;                       /* sinc filter order */
    uint32_t sinc_oversample;                   /* sinc filter oversampling rate */
    uint32_t integrator_oversample;             /* integrator oversampling rate */
    uint32_t ht_break_signal;                   /* high threshold event break signal distribution */
    uint32_t lt_break_signal;                   /* low threshold event break signal distribution */
}hpdf_filter_parameter_struct;

/* regular conversions configuration params */
typedef struct
{
    uint32_t fast_mode;                         /* fast conversion mode enable for regular conversions */
    uint32_t rcs_channel;                       /* regular conversion channel */
    uint32_t rcdmaen;                           /* DMA channel enabled to read data for the regular conversion */
    uint32_t rcsyn;                             /* regular conversion synchronously */
    uint32_t continuous_mode;                   /* regular conversions continuous mode */
}hpdf_rc_parameter_struct;

/* inserted conversions configuration params */
typedef struct
{
    uint32_t trigger_edge;                      /* inserted conversions trigger edge */
    uint32_t trigger_signal;                    /* inserted conversions trigger signal */
    uint32_t icdmaen;                           /* DMA channel enabled to read data for the inserted channel group */
    uint32_t scmod;                             /* scan conversion mode of inserted conversions */
    uint32_t icsyn;                             /* inserted conversion synchronously */
    uint32_t ic_channel_group;                  /* inserted channel group selection */
}hpdf_ic_parameter_struct;

/* enum definitions */
/* HPDF channel */
typedef enum
{
    CHANNEL0 = 0,                               /* HPDF channel0 */
    CHANNEL1                                    /* HPDF channel1 */
}hpdf_channel_enum;

/* HPDF filter */
typedef enum
{
    FLT0 = 0,                                   /* HPDF filter0 */
    FLT1                                        /* HPDF filter1 */
}hpdf_filter_enum;

/* HPDF channel definitions */
/* serial clock output source definitions */
#define SERIAL_SYSTEM_CLK              ((uint32_t)0x00000000U)                          /*!< serial clock output source is from system clock */
#define SERIAL_AUDIO_CLK                HPDF_CH0CTL_CKOUTSEL                            /*!< serial clock output source is from audio clock */

/* serial clock output duty mode definitions */
#define CKOUTDM_DISABLE                 ((uint32_t)0x00000000U)                         /*!< serial clock output duty mode disable */
#define CKOUTDM_ENABLE                  HPDF_CH0CTL_CKOUTDM                             /*!< serial clock output duty mode enable */

/* data packing mode definitions */
#define DPM(regval)                    (BITS(14,15) & ((uint32_t)(regval) << 14))       /*!< select data packing mode */
#define DPM_STANDARD_MODE               DPM(0)                                          /*!< standard mode */
#define DPM_INTERLEAVED_MODE            DPM(1)                                          /*!< interleaved mode */
#define DPM_DUAL_MODE                   DPM(2)                                          /*!< dual mode */

/* input data source for channel definitions */
#define IDATASEL(regval)               (BITS(12,13) & ((uint32_t)(regval) << 12))       /*!< select channel y multiplexer input data source */
#define SERIAL_INPUT                    IDATASEL(0)                                     /*!< input data source for channel is taken from serial inputs */
#define INTERNAL_INPUT                  IDATASEL(2)                                     /*!< input data source for channel is taken from internal HPDF_CHxPDI register */

/* channel inputs pins definitions */
#define CHPINSEL_CURRENT               ((uint32_t)0x00000000U)                          /*!< channel inputs select pins of the current channel */
#define CHPINSEL_NEXT                   HPDF_CHxCTL_CHPINSEL                            /*!< channel inputs select pins of the next channel */

/* clock loss detector definitions */
#define CLK_LOSS_DISABLE               ((uint32_t)0x00000000U)                          /*!< clock loss detector disable */
#define CLK_LOSS_ENABLE                 HPDF_CHxCTL_CKLEN                               /*!< clock loss detector enable */

/* SPI clock source definitions */
#define SPICKSS(regval)                 (BITS(2,3) & ((uint32_t)(regval) << 2))         /*!< select SPI clock source */
#define EXTERNAL_CKIN                   SPICKSS(0)                                      /*!< external CKINy input */
#define INTERNAL_CKOUT                  SPICKSS(1)                                      /*!< internal CKOUT output */
#define HALF_CKOUT_FALLING_EDGE         SPICKSS(2)                                      /*!< internal CKOUT output, sampling point on each second CKOUT falling edge. */
#define HALF_CKOUT_RISING_EDGE          SPICKSS(3)                                      /*!< internal CKOUT output, sampling point on each second CKOUT rising edge */

/* serial interface type definitions */
#define SITYP(regval)                   (BITS(0,1) & ((uint32_t)(regval)))              /*!< select serial interface type */
#define SPI_RISING_EDGE                 SITYP(0)                                        /*!< SPI interface, sample data on rising edge */
#define SPI_FALLING_EDGE                SITYP(1)                                        /*!< SPI interface, sample data on falling edge */
#define MANCHESTER_CODE0                SITYP(2)                                        /*!< manchester coded input: rising edge = logic 0, falling edge = logic 1 */
#define MANCHESTER_CODE1                SITYP(3)                                        /*!< manchester coded input: rising edge = logic 1, falling edge = logic 0 */

/* malfunction monitor detector definitions */
#define MM_DISABLE                    ((uint32_t)0x00000000U)                           /*!< malfunction monitor disable */
#define MM_ENABLE                      HPDF_CHxCTL_MMEN                                 /*!< malfunction monitor enable */

/* malfunction monitor detector break signal definitions */
#define MMBSD(regval)                  (BITS(12,13) & ((uint32_t)(regval)<< 12 ))       /*!< select break signal on channel */
#define NO_MM_BREAK                    MMBSD(0)                                         /*!< break signal is not distributed to malfunction monitor on channel */
#define MM_BREAK0                      MMBSD(1)                                         /*!< break signal 0 is distributed to malfunction monitor on channel 0 */
#define MM_BREAK1                      MMBSD(2)                                         /*!< break signal 1 is distributed to malfunction monitor on channel */
#define MM_BREAK0_1                    MMBSD(3)                                         /*!< break signal 0 and 1 is distributed to malfunction monitor on channel */

/* threshold monitor fast mode definitions */
#define TMFM_DISABLE                    ((uint32_t)0x00000000U)                         /*!< threshold monitor fast mode disable */
#define TMFM_ENABLE                     HPDF_FLTyCTL0_TMFM                              /*!< threshold monitor fast mode enable */

/* regular conversions configuration definitions */
/* fast conversion mode definitions */
#define FAST_DISABLE                     ((uint32_t)0x00000000U)                        /*!< fast conversion mode disable */
#define FAST_ENABLE                      HPDF_FLTyCTL0_FAST                             /*!< fast conversion mode enable */

/* regular conversion channel selection definitions */
#define RCS_CHANNEL0                    ((uint32_t)0x00000000U)                         /*!< channel 0 is selected as the regular conversion channel */
#define RCS_CHANNEL1                    HPDF_FLTyCTL0_RCS                               /*!< channel 1 is selected as the regular conversion channel */

