burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_hpdf.h
/*threshold monitor channel definitions */
#define TMCHEN(regval)                  (BITS(16,17) & ((uint32_t)(regval)<< 16))       /*!< select threshold monitor channel */
#define TMCHEN_DISABLE                  TMCHEN(0)                                       /*!< threshold monitor is disabled on channel 0 and channel 1 */
#define TMCHEN_CHANNEL0                 TMCHEN(1)                                       /*!< threshold monitor is enabled on channel 0 */
#define TMCHEN_CHANNEL1                 TMCHEN(2)                                       /*!< threshold monitor is enabled on channel 1 */
#define TMCHEN_CHANNEL0_1               TMCHEN(3)                                       /*!< threshold monitor is enabled on channel 0 and channel 1 */

/* threshold monitor high threshold event break signal definitions */
#define HTBSD(regval)                   (BITS(0,1) & ((uint32_t)(regval)<< 0))          /*!< select high threshold event break signal */
#define NO_TM_HT_BREAK                  HTBSD(0)                                        /*!< break signal is not distributed to an threshold monitor high threshold event */
#define TM_HT_BREAK0                    HTBSD(1)                                        /*!< break signal 0 is distributed to an threshold monitor high threshold event */
#define TM_HT_BREAK1                    HTBSD(2)                                        /*!< break signal 1 is distributed to an threshold monitor high threshold event */
#define TM_HT_BREAK0_1                  HTBSD(3)                                        /*!< break signal 0 and 1 is distributed to an threshold monitor high threshold event */

/* threshold monitor low threshold event break signal definitions */
#define LTBSD(regval)                   (BITS(0,1) & ((uint32_t)(regval)<< 0))          /*!< select low threshold event break signal */
#define NO_TM_LT_BREAK                  LTBSD(0)                                        /*!< break signal is not distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK0                    LTBSD(1)                                        /*!< break signal 0 is distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK1                    LTBSD(2)                                        /*!< break signal 1 is distributed to an threshold monitor low threshold event */
#define TM_LT_BREAK0_1                  LTBSD(3)                                        /*!< break signal 0 and 1 is distributed to an threshold monitor low threshold event */

/* threshold monitor bypass definitions */
#define TM_FLT_BYPASS                   ((uint32_t)0x00000001U)                         /*!< the threshold monitor filter is bypassed. */

/* extremes monitor definitions */
/* extremes monitor channel definitions */
#define EMCS(regval)                    (BITS(8,9) & ((uint32_t)(regval)<< 8))          /*!< select extremes monitor channel */
#define EM_CHANNEL_DISABLE              EMCS(0)                                         /*!< extremes monitor y does not accept data from channel 0 and channel 1 */
#define EM_CHANNEL0                     EMCS(1)                                         /*!< extremes monitor y accepts data from channel 0 */
#define EM_CHANNEL1                     EMCS(2)                                         /*!< extremes monitor y accepts data from channel 1 */
#define EM_CHANNEL0_1                   EMCS(3)                                         /*!< extremes monitor y accepts data from channel 0 and channel 1 */

/* HPDF flags and interrupt definitions */
/* define the HPDF bit position and its register index offset */
#define HPDF_FLT0                                             ((uint32_t)0x40016100U)
#define HPDF_FLT1                                             ((uint32_t)0x40016180U)
#define HPDF_REGIDX_BIT(regidx, bitpos)                       (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define HPDF_REG_VAL(regidx, offset)                          (REG32((regidx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define HPDF_BIT_POS(val)                                     ((uint32_t)(val) & 0x0000001FU)
#define HPDF_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)    (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define HPDF_REG_VAL2(regidx, offset)                         (REG32((regidx) + ((uint32_t)(offset) >> 22)))
#define HPDF_BIT_POS2(val)                                    (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define FLTyCTL1_REG_OFFSET                                   ((uint16_t)0x0004U)        /*!< the offset of FLTyCTL1 register */
#define FLTySTAT_REG_OFFSET                                   ((uint16_t)0x0008U)        /*!< the offset of FLTySTAT register */
#define FLTyRDATA_REG_OFFSET                                  ((uint16_t)0x001CU)        /*!< the offset of FLTyRDATA register */
#define FLTyTMSTAT_REG_OFFSET                                 ((uint16_t)0x0028U)        /*!< the offset of FLTyTMSTAT register */

/* HPDF flags */
typedef enum
{
    /* flags in FLTySTAT register */
    HPDF_FLAG_FLTy_ICEF      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 0U),                 /*!< inserted conversion end flag */
    HPDF_FLAG_FLTy_RCEF      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 1U),                 /*!< regular conversion end flag */
    HPDF_FLAG_FLTy_ICDOF     = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 2U),                 /*!< inserted conversion overflow flag */
    HPDF_FLAG_FLTy_RCDOF     = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 3U),                 /*!< regular conversion overflow flag */
    HPDF_FLAG_FLTy_TMEOF     = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 4U),                 /*!< threshold monitor event occurred flag */
    HPDF_FLAG_FLTy_ICPF      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 13U),                /*!< inserted conversion in progress flag */
    HPDF_FLAG_FLTy_RCPF      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 14U),                /*!< regular conversion in progress flag */
    HPDF_FLAG_FLT0_CKLF0     = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 16U),                /*!< clock loss on channel 0 flag */
    HPDF_FLAG_FLT0_CKLF1     = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 17U),                /*!< clock loss on channel 1 flag */
    HPDF_FLAG_FLT0_MMF0      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 24U),                /*!< malfunction event occurred on channel 0 flag */
    HPDF_FLAG_FLT0_MMF1      = HPDF_REGIDX_BIT(FLTySTAT_REG_OFFSET, 25U),                /*!< malfunction event occurred on channel 1 flag */
    /* flags in FLT0RDATA register */
    HPDF_FLAG_FLTy_RCHPDT    = HPDF_REGIDX_BIT(FLTyRDATA_REG_OFFSET, 4U),                /*!< regular channel pending data */
    /* flags in FLTyTMSTAT register */
    HPDF_FLAG_FLTy_LTF0      = HPDF_REGIDX_BIT(FLTyTMSTAT_REG_OFFSET, 0U),               /*!< threshold monitor low threshold on channel 0 flag */
    HPDF_FLAG_FLTy_LTF1      = HPDF_REGIDX_BIT(FLTyTMSTAT_REG_OFFSET, 1U),               /*!< threshold monitor low threshold on channel 1 flag */
    HPDF_FLAG_FLTy_HTF0      = HPDF_REGIDX_BIT(FLTyTMSTAT_REG_OFFSET, 8U),               /*!< threshold monitor high threshold on channel 0 flag */
    HPDF_FLAG_FLTy_HTF1      = HPDF_REGIDX_BIT(FLTyTMSTAT_REG_OFFSET, 9U),               /*!< threshold monitor high threshold on channel 1 flag */
}hpdf_flag_enum;

/* HPDF interrupt flags */
typedef enum
{
    /* interrupt flags in FLTySTAT register */
    HPDF_INT_FLAG_FLTy_ICEF      = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 0U, FLTySTAT_REG_OFFSET, 0U),      /*!< inserted conversion end interrupt flag */
    HPDF_INT_FLAG_FLTy_RCEF      = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 1U, FLTySTAT_REG_OFFSET, 1U),      /*!< regular conversion end interrupt flag */
    HPDF_INT_FLAG_FLTy_ICDOF     = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 2U, FLTySTAT_REG_OFFSET, 2U),      /*!< inserted conversion overflow interrupt flag */
    HPDF_INT_FLAG_FLTy_RCDOF     = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 3U, FLTySTAT_REG_OFFSET, 3U),      /*!< regular conversion overflow interrupt flag */
    HPDF_INT_FLAG_FLTy_TMEOF     = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 4U, FLTySTAT_REG_OFFSET, 4U),      /*!< threshold monitor event occurred interrupt flag */
    HPDF_INT_FLAG_FLT0_CKLF0     = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 6U, FLTySTAT_REG_OFFSET, 16U),     /*!< clock loss on channel 0 interrupt flag */
    HPDF_INT_FLAG_FLT0_CKLF1     = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 6U, FLTySTAT_REG_OFFSET, 17U),     /*!< clock loss on channel 1 interrupt flag */
    HPDF_INT_FLAG_FLT0_MMF0      = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 5U, FLTySTAT_REG_OFFSET, 24U),     /*!< malfunction monitor detection on channel 0 interrupt flag */
    HPDF_INT_FLAG_FLT0_MMF1      = HPDF_REGIDX_BIT2(FLTyCTL1_REG_OFFSET, 5U, FLTySTAT_REG_OFFSET, 25U),     /*!< malfunction monitor detection on channel 1 interrupt flag */
}hpdf_interrupt_flag_enum;

/* HPDF interrupt */
typedef enum
{
    /* interrupt in FLTyCTL1 register */
    HPDF_INT_FLTy_ICEIE      = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 0U),            /*!< inserted conversion end interrupt enable */    
    HPDF_INT_FLTy_RCEIE      = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 1U),            /*!< regular conversion end interrupt enable */
    HPDF_INT_FLTy_ICDOIE     = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 2U),            /*!< inserted conversion data overflow interrupt enable */
    HPDF_INT_FLTy_RCDOIE     = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 3U),            /*!< regular conversion data overflow interrupt enable */
    HPDF_INT_FLTy_TMIE       = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 4U),            /*!< threshold monitor interrupt enable */
    HPDF_INT_FLT0_MMIE       = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 5U),            /*!< malfunction monitor interrupt enable */
    HPDF_INT_FLT0_CKLIE      = HPDF_REGIDX_BIT(FLTyCTL1_REG_OFFSET, 6U),            /*!< clock loss interrupt enable */
}hpdf_interrupt_enum;

/* function declarations */
/* initialize HPDF channel and filter registers */
/* reset HPDF */
void hpdf_deinit(void);
/* initialize the parameters of HPDF channel struct with the default values */
void hpdf_channel_struct_para_init(hpdf_channel_parameter_struct *init_struct);
/* initialize the parameters of HPDF filter struct with the default values */
void hpdf_filter_struct_para_init(hpdf_filter_parameter_struct *init_struct);
/* initialize the parameters of regular conversion struct with the default values */
void hpdf_rc_struct_para_init(hpdf_rc_parameter_struct *init_struct);
/* initialize the parameters of inserted conversion struct with the default values */
void hpdf_ic_struct_para_init(hpdf_ic_parameter_struct *init_struct);
/* enable the HPDF module globally */
void hpdf_enable(void);
/* disable the HPDF module globally */
void hpdf_disable(void);
/* initialize the HPDF channel */
void hpdf_channel_init(hpdf_channel_enum channelx, hpdf_channel_parameter_struct *init_struct);
/* initialize the HPDF filter */
void hpdf_filter_init(hpdf_filter_enum filtery, hpdf_filter_parameter_struct *init_struct);
/* initialize the regular conversion */
void hpdf_rc_init(hpdf_filter_enum filtery, hpdf_rc_parameter_struct *init_struct);
/* initialize the inserted conversion */
void hpdf_ic_init(hpdf_filter_enum filtery, hpdf_ic_parameter_struct *init_struct);

/* configure the HPDF clock output */
/* configure serial output clock */
void hpdf_clock_output_config(uint32_t source, uint8_t divider, uint32_t mode);
/* configure serial clock output source */
void hpdf_clock_output_source_config(uint32_t source);
/* disable serial clock output duty mode */
void hpdf_clock_output_duty_mode_disable(void);
/* enable serial clock output duty mode */
void hpdf_clock_output_duty_mode_enable(void);
/* configure serial clock output divider */ 
void hpdf_clock_output_divider_config(uint8_t divider);

